{"link":"EventList.aspx?fromdate=11/18/2017&todate=11/18/2017&display=Day&type=public&eventidn=32343&view=EventDetails&information_id=75828","name":"Arkansas Teacher Corps DEADLINE Approaching","desc":"Arkansas Teacher Corps of the College of Education and Health Professions is now accepting applications for their 2018 Cohort. ATC invites seniors and graduates from all backgrounds and majors to apply for the rigorous three year Fellowship. Individuals admitted into the program will attend summer training in the Arkansas Delta and begin teaching in an Arkansas school in the fall of 2018. ATC Fellows serve for three years in their original placement districts, are paid normal teaching salaries and collect teacher benefits, and are required to participate in ongoing training and teacher development throughout their commitment. In addition to teacher salary, ATC provides Fellows with $15,000 of stipends over the course of the three year commitment. There are also numerous student loan and tuition incentive programs that apply to teachers serving in high need school districts in Arkansas. For more information or to submit your application visit arkansasteachercorps.org today!"}{"link":"EventList.aspx?fromdate=11/18/2017&todate=11/18/2017&display=Day&type=public&eventidn=32328&view=EventDetails&information_id=75798","name":"Corona de Sombra","desc":"The Spanish Program presents “Corona de Sombra” at 7 p.m. Thursday and Friday, November 16 and 17, 2017 in the Arkansas Union Theatre on the fourth floor of the Arkansas Union at the University of Arkansas.","loc":"Arkansas Union "}{"link":"EventList.aspx?fromdate=11/18/2017&todate=11/18/2017&display=Day&type=public&eventidn=32299&view=EventDetails&information_id=75732","name":"La Tertulia (Spanish Conversation Club)","desc":"Expand your knowledge and improve your speaking skills by joining La Tertulia (Spanish Conversation Club)! La Tertulia is offered to beginner/intermediate and advance Spanish speakers."}{"link":"EventList.aspx?fromdate=11/18/2017&todate=11/18/2017&display=Day&type=public&eventidn=31241&view=EventDetails&information_id=73212","name":"Call For Papers: Southeastern Medieval Association Annual Conference 2017","desc":"The College of Charleston and The Citadel are proud to sponsor the 2017 annual meeting of the Southeastern Medieval Association (SEMA), November 16-18, at the Francis Marion Hotel, in Charleston, South Carolina."}{"link":"EventList.aspx?fromdate=11/18/2017&todate=11/18/2017&display=Day&type=public&eventidn=32311&view=EventDetails&information_id=75766","name":"Diwali Banquet","desc":"Friends of India is Celebrating its 50th Year Anniversary along with Diwali Banquet. Diwali is the festival of Lights celebrated on the occasion of the victory of good over evil. ","loc":"15 W. Mountain St. "}{"link":"EventList.aspx?fromdate=11/18/2017&todate=11/18/2017&display=Day&type=public&eventidn=32220&view=EventDetails&information_id=75577","name":"Razorback Football vs Mississippi State","desc":"Come out and watch your Razorback Football team as they take on Mississippi State!","loc":"#1 University of Arkansas "}{"link":"EventList.aspx?fromdate=11/18/2017&todate=11/18/2017&display=Day&type=public&eventidn=32303&view=EventDetails&information_id=75740","name":"Tertulia (Spanish Conversation Club)","desc":"Expand your knowledge and improve your speaking skills by joining Tertulia (Spanish Conversation Club)! Tertulia is offered to beginner/intermediate and advance Spanish speakers."}